Revit 2027 API
AdvancedTransparent Class
 A static class that provides access to the property names that appear in the AdvancedTransparent visual asset schema.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AdvancedTransparent
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class AdvancedTransparent
Public NotInheritable Class AdvancedTransparent
public ref class AdvancedTransparent abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type AdvancedTransparent = class end
The AdvancedTransparent type exposes the following members.
Properties
Name | Description
SurfaceAlbedo |  The property labeled "Color" from the "AdvancedTransparent" schema.
SurfaceAnisotropy |  The property labeled "Anisotropy" from the "AdvancedTransparent" schema.
SurfaceCutout |  The property labeled "Image" from the "AdvancedTransparent" schema.
SurfaceNdfType |  The property labeled "NDF" from the "AdvancedTransparent" schema.
SurfaceNormal |  The property labeled "Image" from the "AdvancedTransparent" schema.
SurfaceRotation |  The property labeled "Rotation" from the "AdvancedTransparent" schema.
SurfaceRoughness |  The property labeled "Roughness" from the "AdvancedTransparent" schema.
TransparentColor |  The property labeled "Color" from the "AdvancedTransparent" schema.
TransparentDistance |  The property labeled "Transparent Distance" from the "AdvancedTransparent" schema.
TransparentIor |  The property labeled "IOR" from the "AdvancedTransparent" schema.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace